JUMA-IO/STM32_Platform/system/bsp/cannon_v1/stm32f4xx_cannon_v1.c
    /* Set LCD data/command line DC to High */
    LCD_DC_HIGH();

    if (Size == 1)
    {
        /* Only 1 byte to be sent to LCD - general interface can be used */
        /* Send Data */
        SPIx_Write(*pData);
    }
    else
    {
        /* Several data should be sent in a raw */
        /* Direct SPI accesses for optimization */
        for (counter = Size; counter != 0; counter--)
        {
            while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
            {
            }
            /* Need to invert bytes for LCD*/
            *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *(pData+1);

            while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
            {
            }
            *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *pData;
            counter--;
            pData += 2;
        }

        /* Wait until the bus is ready before releasing Chip select */
        while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_BSY) != RESET)
        {
        }
    }

    /* Deselect : Chip Select high */
    LCD_CS_HIGH();
}

/**
  * @brief  Wait for loop in ms.
  * @param  Delay in ms.
  * @retval None
  */
void LCD_Delay(uint32_t Delay)
{
    HAL_Delay(Delay);
}

/******************************* LINK JOYSTICK ********************************/
/**
  * @brief  Initializes ADC MSP.
  * @param  None
  * @retval None
  */
static void ADCx_MspInit(ADC_HandleTypeDef *hadc)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /*** Configure the GPIOs ***/
    /* Enable GPIO clock */
    NUCLEO_ADCx_GPIO_CLK_ENABLE();

    /* Configure the selected ADC Channel as analog input */
    GPIO_InitStruct.Pin = NUCLEO_ADCx_GPIO_PIN ;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(NUCLEO_ADCx_GPIO_PORT, &GPIO_InitStruct);

    /*** Configure the ADC peripheral ***/
    /* Enable ADC clock */
    NUCLEO_ADCx_CLK_ENABLE();
}

/**
  * @brief  Initializes ADC HAL.
  * @param  None
  * @retval None
  */
static void ADCx_Init(void)
{
    if(HAL_ADC_GetState(&hnucleo_Adc) == HAL_ADC_STATE_RESET)
    {
        /* ADC Config */
        hnucleo_Adc.Instance                   = NUCLEO_ADCx;
        hnucleo_Adc.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV4; /* (must not exceed 36MHz) */
        hnucleo_Adc.Init.Resolution            = ADC_RESOLUTION12b;
        hnucleo_Adc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
        hnucleo_Adc.Init.ContinuousConvMode    = DISABLE;
        hnucleo_Adc.Init.DiscontinuousConvMode = DISABLE;
        hnucleo_Adc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
        hnucleo_Adc.Init.EOCSelection          = EOC_SINGLE_CONV;
        hnucleo_Adc.Init.NbrOfConversion       = 1;
        hnucleo_Adc.Init.DMAContinuousRequests = DISABLE;

        ADCx_MspInit(&hnucleo_Adc);
        HAL_ADC_Init(&hnucleo_Adc);
    }
}

/**
  * @brief  Configures joystick available on adafruit 1.8" TFT shield
  *         managed through ADC to detect motion.
  * @param  None
  * @retval Joystickstatus (0=> success, 1=> fail)
  */
uint8_t BSP_JOY_Init(void)
{
    uint8_t status = 1;

    ADCx_Init();

    /* Select the ADC Channel to be converted */
    sConfig.Channel = NUCLEO_ADCx_CHANNEL;
    sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
    sConfig.Rank = 1;
    status = HAL_ADC_ConfigChannel(&hnucleo_Adc, &sConfig);

    /* Return Joystick initialization status */
    return status;
}

/**
  * @brief  Returns the Joystick key pressed.
  * @note   To know which Joystick key is pressed we need to detect the voltage
  *         level on each key output
  *           - None  : 3.3 V / 4095
  *           - SEL   : 1.055 V / 1308
  *           - DOWN  : 0.71 V / 88
  *           - LEFT  : 3.0 V / 3720
  *           - RIGHT : 0.595 V / 737
  *           - UP    : 1.65 V / 2046
  * @retval JOYState_TypeDef: Code of the Joystick key pressed.
  */
JOYState_TypeDef BSP_JOY_GetState(void)
{
    JOYState_TypeDef state;
    uint16_t  keyconvertedvalue = 0;

    /* Start the conversion process */
    HAL_ADC_Start(&hnucleo_Adc);

    /* Wait for the end of conversion */
    HAL_ADC_PollForConversion(&hnucleo_Adc, 10);

    /* Check if the continuous conversion of regular channel is finished */
    if(HAL_ADC_GetState(&hnucleo_Adc) == HAL_ADC_STATE_EOC_REG)
    {
        /* Get the converted value of regular channel */
        keyconvertedvalue = HAL_ADC_GetValue(&hnucleo_Adc);
    }

    if((keyconvertedvalue > 2010) && (keyconvertedvalue < 2090))
    {
        state = JOY_UP;
    }
    else if((keyconvertedvalue > 680) && (keyconvertedvalue < 780))
    {
        state = JOY_RIGHT;
    }
    else if((keyconvertedvalue > 1270) && (keyconvertedvalue < 1350))
    {
        state = JOY_SEL;
    }
    else if((keyconvertedvalue > 50) && (keyconvertedvalue < 130))
    {
        state = JOY_DOWN;
    }
    else if((keyconvertedvalue > 3680) && (keyconvertedvalue < 3760))
    {
        state = JOY_LEFT;
    }
    else
    {
        state = JOY_NONE;
    }

    /* Loop while a key is pressed */
    if(state != JOY_NONE)
    {
        keyconvertedvalue = HAL_ADC_GetValue(&hnucleo_Adc);
    }
    /* Return the code of the Joystick key pressed */
    return state;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
